package uz.univer.argis.domain

class MainRepository {
  val listRegions = ArrayList<String>()
  val maplistCity = HashMap<String, ArrayList<String>>()

  init {
    loadRegions()
    loadShaxar()
  }

  private fun loadRegions() {
    listRegions.add("Андижон")
    listRegions.add("Бухоро")
    listRegions.add("Жиззах")
    listRegions.add("Қашқадарё")
    listRegions.add("Навоий")
    listRegions.add("Наманган")
    listRegions.add("Самарқанд")
    listRegions.add("Сурхондарё")
    listRegions.add("Сирдарё")
    listRegions.add("Тошкент")
    listRegions.add("Фарғона")
    listRegions.add("Хоразм")
    listRegions.add("Тошкент ш.")
    listRegions.add("Қорақалпоғистон Республикаси")
  }

  fun loadShaxar() {
    maplistCity["Навоий"] = arrayListOf(
      "Навоий ш.", "Заpафшон ш.", "Конимех",
      "Қизилтепа", "Навбаҳор", "Кармана",
      "Нурота", "Томди", "Учқудуқ", "Хатирчи", "Ғозғон ш."
    )
    maplistCity["Наманган"] = arrayListOf(
      "Косонсой", "Наманган ш.", "Норин", "Поп", "Тўрақўрғон", "Уйчи", "Учқўрғон", "Чортоқ",
      "Учқўрғ",
      "Янгиқўрғон",
      "Давлатобод"
    )
    maplistCity["Самарқанд"] = arrayListOf(
      "Самарқанд ш.",
      "Каттақўрғон ш.",
      "Оқдарё",
      "Булунғур",
      "Жомбой",
      "Иштихон",
      "Каттақўрғон",
      "Қўшробод",
      "Нарпай",
      "Пойариқ",
      "Пастдарғом",
      "Пахтачи",
      "Нуробод",
      "Ургут",
      "Тойлоқ",
    )
    maplistCity["Андижон"] = arrayListOf(
      "Андижон ш.",
      "Хонобод ш.",
      "Олтинкўл",
      "Балиқчи",
      "Бўстон",
      "Булоқбоши",
      "Жалолқудуқ",
      "Избоскан",
      "Улуғноp",
      "Қўрғонтепа",
      "Асака",
      "Мархамат",
      "Шаҳриҳон",
      "Пахтаобод",
      "Хўжаобод",
    )

    maplistCity["Тошкент ш."] = arrayListOf(
      "Учтепа",
      "Бектемир",
      "Юнусобод",
      "Бектемир",
      "Мирзо Улуғбек",
      "Миробод",
      "Шайхонтохур",
      "Олмазор",
      "Сирғали",
      "Яккасарой",
      "Яшнобод",
      "Чилонзор",
      "Янгиҳаёт",
    )
    maplistCity["Қашқадарё"] = arrayListOf(
      "Қарши ш.",
      "Шаҳрисабз ш.",
      "Ғузор",
      "Деҳқонобод",
      "Қамаши",
      "Қарши",
      "Косон",
      "Китоб",
      "Миришкор",
      "Муборак",
      "Нишон",
      "Касби",
      "Чироқчи",
      "Шаҳрисабз",
      "Яккабоғ"
    )
    maplistCity["Жиззах"] = arrayListOf(
      "Жиззах ш.",
      "туманлар:",
      "Арнасой",
      "Бахмал",
      "Ғаллаорол",
      "Шароф Рашидоф",
      "Дўстлик",
      "Зомин",
      "Зарбдор",
      "Мирзачўл",
      "Зафаробод",
      "Пахтакор",
      "Фориш",
      "Янгиобод",
    )
    maplistCity["Хоразм"] = arrayListOf(
      "Урганч ш.",
      "Хива ш.",
      "Боғот",
      "Гурлан",
      "Қўшкўпир",
      "Урганч",
      "Хазорасп",
      "Хонқа",
      "Хива",
      "Шовот",
      "Янгиариқ",
      "Янгибозор",
      "Тупроққалъа",
    )
    maplistCity["Хоразм"] = arrayListOf(
      "Фарғона ш.",
      "Қўқон ш.",
      "Қувасой ш.",
      "Маpғилон ш.",
      "туманлар:",
      "Олтиариқ",
      "Қўштепа",
      "Боғдод",
      "Бувайда",
      "Бешариқ",
      "Қува",
      "Учкўприк",
      "Риштон",
      "Сўх",
      "Тошлоқ",
      "Ўзбекистон",
      "Фарғона",
      "Данғара",
      "Фурқат",
      "Ёзёвон"
    )
    maplistCity["Сурхондарё"] = arrayListOf(
      "Термиз ш.",
      "Олтинсой",
      "Ангор",
      "Бойсун",
      "Музробод",
      "Денов",
      "Жарқўрғон",
      "Қумқўрғон",
      "Қизириқ",
      "Сариосиё",
      "Термиз",
      "Узун",
      "Шеробод",
      "Шўрчи",
      "Бандихон",
    )
    maplistCity["Сирдарё"] = arrayListOf(
      "Гулистон ш.",
      "Шиpин ш.",
      "Янгиеp ш .",
      "Оқолтин",
      "Боёвут",
      "Сайхунобод",
      "Гулистон",
      "Сардоба",
      "Мирзаобод",
      "Сирдарё",
      "Ховос",
    )
  }
}












